yhfudev/brtos/GLCD/SSD1289_STM32F4_Driver/gdisp_lld.c
/*
    ChibiOS/RT - Copyright (C) 2012
                 Joel Bodenmann aka Tectu <joel@unormal.org>

    This file is part of ChibiOS-LCD-Driver.

    ChibiOS-LCD-Driver is free software; you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation; either version 3 of the License, or
    (at your option) any later version.

    ChibiOS-LCD-Driver is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

/**
 * @file    gdispSsd1289/gdisp_lld.c
 * @brief   GDISP Graphics Driver subsystem low level driver source for the Ssd1289 display.
 *
 * @addtogroup GDISP
 * @{
 */

//#include "ch.h"
//#include "hal.h"
#include "gdisp.h"
#include "gdisp_lld.h"
#include "BRTOS.h"
#include "stm32f4xx.h"
#include <stddef.h>

//#if HAL_USE_GDISP || defined(__DOXYGEN__)

/* Include the emulation code for things we don't support */
#include "gdisp_emulation.c"

//#include "ssd1289_lld.c.h"
static __inline void lld_lcdWriteIndex(uint16_t index)		{ LCD_REG = index; }
//static __inline void lld_lcdWriteData(uint16_t data)		{ LCD_RAM = data; }
#define lld_lcdWriteData(x)	LCD_RAM = x
static __inline void lld_lcdWriteReg(uint16_t lcdReg,uint16_t lcdRegValue) {
  LCD_REG = lcdReg;
  LCD_RAM = lcdRegValue;
}
static __inline uint16_t lld_lcdReadData(void)				{ return (LCD_RAM); }
static __inline uint16_t lld_lcdReadReg(uint16_t lcdReg) {
  //volatile uint16_t dummy;

  LCD_REG = lcdReg;
  (void)LCD_RAM;
  return (LCD_RAM);
}
static __inline void lld_lcdWriteStreamStart(void)			{ LCD_REG = 0x0022; }
static __inline void lld_lcdWriteStreamStop(void)			{}
static __inline void lld_lcdWriteStream(uint16_t *buffer, uint16_t size) {
  uint16_t i;

  for(i = 0; i < size; i++) LCD_RAM = buffer[i];
}
static __inline void lld_lcdReadStreamStart(void)			{ LCD_REG = 0x0022; }
static __inline void lld_lcdReadStreamStop(void)			{}
static __inline void lld_lcdReadStream(uint16_t *buffer, size_t size) {
  uint16_t i;
  //volatile uint16_t dummy;

  (void)LCD_RAM; /* throw away first value read */
  for(i = 0; i < size; i++) buffer[i] = LCD_RAM;
}
/* ATUALIZAR AQUI*/
static __inline void lld_lcdDelay(uint16_t us) {
  //chThdSleepMicroseconds(us);
  INT16U time;
  if (us<1000)
  {
	  time = 1;
  }
  else
  {
	  time = us/1000;
  }
  DelayTask(time);

}


static void lld_lcdSetCursor(uint16_t x, uint16_t y) {
  /* Reg 0x004E is an 8 bit value
   * Reg 0x004F is 9 bit
   * Use a bit mask to make sure they are not set too high
   */
  switch(GDISP.Orientation) {
    case portraitInv:
      lld_lcdWriteReg(0x004e, (SCREEN_WIDTH-1-x) & 0x00FF);
      lld_lcdWriteReg(0x004f, (SCREEN_HEIGHT-1-y) & 0x01FF);
      break;
    case portrait:
      lld_lcdWriteReg(0x004e, x & 0x00FF);
      lld_lcdWriteReg(0x004f, y & 0x01FF);
      break;
    case landscape:
      lld_lcdWriteReg(0x004e, y & 0x00FF);
      lld_lcdWriteReg(0x004f, x & 0x01FF);
      break;
    case landscapeInv:
      lld_lcdWriteReg(0x004e, (SCREEN_WIDTH - y - 1) & 0x00FF);
      lld_lcdWriteReg(0x004f, (SCREEN_HEIGHT - x - 1) & 0x01FF);
      break;
    }
}

static void lld_lcdSetViewPort(uint16_t x, uint16_t y, uint16_t cx, uint16_t cy) {
  lld_lcdSetCursor(x, y);

  /* Reg 0x44 - Horizontal RAM address position
   * 		Upper Byte - HEA
   * 		Lower Byte - HSA
   * 		0 <= HSA <= HEA <= 0xEF
   * Reg 0x45,0x46 - Vertical RAM address position
   * 		Lower 9 bits gives 0-511 range in each value
   * 		0 <= Reg(0x45) <= Reg(0x46) <= 0x13F
   */

  switch(GDISP.Orientation) {
    case portrait:
      lld_lcdWriteReg(0x44, (((x+cx-1) << 8) & 0xFF00 ) | (x & 0x00FF));
      lld_lcdWriteReg(0x45, y & 0x01FF);
      lld_lcdWriteReg(0x46, (y+cy-1) & 0x01FF);
      break;
    case landscape:
      lld_lcdWriteReg(0x44, (((x+cx-1) << 8) & 0xFF00) | ((y+cy) & 0x00FF));
      lld_lcdWriteReg(0x45, x & 0x01FF);
      lld_lcdWriteReg(0x46, (x+cx-1) & 0x01FF);
      break;
    case portraitInv:
      lld_lcdWriteReg(0x44, (((SCREEN_WIDTH-x-1) & 0x00FF) << 8) | ((SCREEN_WIDTH - (x+cx)) & 0x00FF));
      lld_lcdWriteReg(0x45, (SCREEN_HEIGHT-(y+cy)) & 0x01FF);
      lld_lcdWriteReg(0x46, (SCREEN_HEIGHT-y-1) & 0x01FF);
      break;
    case landscapeInv:
      lld_lcdWriteReg(0x44, (((SCREEN_WIDTH - y - 1) & 0x00FF) << 8) | ((SCREEN_WIDTH - (y+cy)) & 0x00FF));
      lld_lcdWriteReg(0x45, (SCREEN_HEIGHT - (x+cx)) & 0x01FF);
      lld_lcdWriteReg(0x46, (SCREEN_HEIGHT - x - 1) & 0x01FF);
      break;
  }
  lld_lcdSetCursor(x, y);
}

static __inline void lld_lcdResetViewPort(void)							{}

/*===========================================================================*/
/* Driver interrupt handlers.                                                */
/*===========================================================================*/

/*===========================================================================*/
/* Driver exported functions.                                                */
/*===========================================================================*/

/* ---- Required Routines ---- */
/*
	The following 2 routines are required.
	All other routines are optional.
*/

/**
 * @brief   Low level GDISP driver initialization.
 *
 * @notapi
 */
bool_t GDISP_LLD(init)(void) {
	#ifdef LCD_USE_FSMC
		#if defined(STM32F1XX) || defined(STM32F3XX)
			/* FSMC setup for F1/F3 */
			//rccEnableAHB(RCC_AHBENR_FSMCEN, 0);

		#elif defined(STM32F4XX) || defined(STM32F2XX)
			/* STM32F2-F4 FSMC init */
			//rccEnableAHB3(RCC_AHB3ENR_FSMCEN, 0);
			RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FSMC, ENABLE);
		#else
		#error "FSMC not implemented for this device"
		#endif


