yhfudev/brtos/GLCD/SSD1289_STM32F4_Driver/gdisp_lld.c
	  /* FSMC pin configuration */
	  GPIO_InitTypeDef GPIO_InitStructure;
	  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD | RCC_AHB1Periph_GPIOE, ENABLE);

	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource0, GPIO_AF_FSMC);		// D2
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource1, GPIO_AF_FSMC);		// D3
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource4, GPIO_AF_FSMC);		// NOE -> RD
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource5, GPIO_AF_FSMC);		// NWE -> WR
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource7, GPIO_AF_FSMC);		// NE1 -> CS
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource8, GPIO_AF_FSMC);		// D13
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource9, GPIO_AF_FSMC);		// D14
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource10, GPIO_AF_FSMC);		// D15
	  //GPIO_PinAFConfig(GPIOD, GPIO_PinSource11, GPIO_AF_FSMC);		// A16 -> RS
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_FSMC);		// D0
	  GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_FSMC);		// D1

	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource4, GPIO_AF_FSMC);		// A20 -> RS
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource7, GPIO_AF_FSMC);		// D4
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource8, GPIO_AF_FSMC);		// D5
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource9, GPIO_AF_FSMC);		// D6
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource10, GPIO_AF_FSMC);		// D7
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource11, GPIO_AF_FSMC);		// D8
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource12, GPIO_AF_FSMC);		// D9
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource13, GPIO_AF_FSMC);		// D10
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource14, GPIO_AF_FSMC);		// D11
	  GPIO_PinAFConfig(GPIOE, GPIO_PinSource15, GPIO_AF_FSMC);		// D12

	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_4 | GPIO_Pin_5 |
									  GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 |
									  GPIO_Pin_14 | GPIO_Pin_15;

	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOD, &GPIO_InitStructure);

	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 |
									  GPIO_Pin_11 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 |
									  GPIO_Pin_15;

	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;

	  GPIO_Init(GPIOE, &GPIO_InitStructure);


//		/* set pins to FSMC mode (using A20) */
//		IOBus busD = {GPIOD, (1 << 0) | (1 << 1) | (1 << 4) | (1 << 5) | (1 << 7) | (1 << 8) |
//								(1 << 9) | (1 << 10) | (1 << 14) | (1 << 15), 0};
//
//		IOBus busE = {GPIOE, (1 << 4) | (1 << 7) | (1 << 8) | (1 << 9) | (1 << 10) | (1 << 11) |
//								(1 << 12) | (1 << 13) | (1 << 14) | (1 << 15), 0};
//
//		palSetBusMode(&busD, PAL_MODE_ALTERNATE(12));
//		palSetBusMode(&busE, PAL_MODE_ALTERNATE(12));

		const unsigned char FSMC_Bank = 0;
		/* FSMC timing */

		FSMC_Bank1->BTCR[FSMC_Bank+1] = (FSMC_BTR1_ADDSET_1 | FSMC_BTR1_ADDSET_3) \
				| (FSMC_BTR1_DATAST_1 | FSMC_BTR1_DATAST_3) \
				| (FSMC_BTR1_BUSTURN_1 | FSMC_BTR1_BUSTURN_3) ;

		/* Bank1 NOR/SRAM control register configuration
		 * This is actually not needed as already set by default after reset */
		FSMC_Bank1->BTCR[FSMC_Bank] = FSMC_BCR1_MWID_0 | FSMC_BCR1_WREN | FSMC_BCR1_MBKEN;
	#elif defined(LCD_USE_GPIO)
		//IOBus busCMD = {LCD_CMD_PORT, (1 << LCD_CS) | (1 << LCD_RS) | (1 << LCD_WR) | (1 << LCD_RD), 0};
		//IOBus busDATA = {LCD_CMD_PORT, 0xFFFFF, 0};
		//palSetBusMode(&busCMD, PAL_MODE_OUTPUT_PUSHPULL);
		//palSetBusMode(&busDATA, PAL_MODE_OUTPUT_PUSHPULL);

	#else
		#error "Please define LCD_USE_FSMC or LCD_USE_GPIO"
	#endif

#if 0
		lld_lcdWriteReg(0x0007,0x0021);    DelayTask(1);
		lld_lcdWriteReg(0x0000,0x0001);    DelayTask(1);
		lld_lcdWriteReg(0x0007,0x0023);    DelayTask(1);
		lld_lcdWriteReg(0x0010,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0007,0x0033);    DelayTask(1);
		lld_lcdWriteReg(0x0011,0x6830);    DelayTask(1);
		lld_lcdWriteReg(0x0002,0x0600);    DelayTask(1);
		lld_lcdWriteReg(0x0012,0x6CEB);    DelayTask(1);
		lld_lcdWriteReg(0x0003,0xA8A4);    DelayTask(1);
		lld_lcdWriteReg(0x000C,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x000D,0x080C);    DelayTask(1);
		lld_lcdWriteReg(0x000E,0x2B00);    DelayTask(1);
		lld_lcdWriteReg(0x001E,0x00B0);    DelayTask(1);
		lld_lcdWriteReg(0x0001,0x2b3F);    DelayTask(1);  //RGB
		lld_lcdWriteReg(0x0005,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0006,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0016,0xEF1C);    DelayTask(1);
		lld_lcdWriteReg(0x0017,0x0103);    DelayTask(1);
		lld_lcdWriteReg(0x000B,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x000F,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0041,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0042,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0048,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0049,0x013F);    DelayTask(1);
		lld_lcdWriteReg(0x004A,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x004B,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0044,0xEF00);    DelayTask(1);
		lld_lcdWriteReg(0x0045,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0046,0x013F);    DelayTask(1);
		lld_lcdWriteReg(0x0030,0x0707);    DelayTask(1);
		lld_lcdWriteReg(0x0031,0x0204);    DelayTask(1);
		lld_lcdWriteReg(0x0032,0x0204);    DelayTask(1);
		lld_lcdWriteReg(0x0033,0x0502);    DelayTask(1);
		lld_lcdWriteReg(0x0034,0x0507);    DelayTask(1);
		lld_lcdWriteReg(0x0035,0x0204);    DelayTask(1);
		lld_lcdWriteReg(0x0036,0x0204);    DelayTask(1);
		lld_lcdWriteReg(0x0037,0x0502);    DelayTask(1);
		lld_lcdWriteReg(0x003A,0x0302);    DelayTask(1);
		lld_lcdWriteReg(0x002F,0x12BE);    DelayTask(1);
		lld_lcdWriteReg(0x003B,0x0302);    DelayTask(1);
		lld_lcdWriteReg(0x0023,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0024,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x0025,0x8000);    DelayTask(1);
		lld_lcdWriteReg(0x004f,0x0000);    DelayTask(1);
		lld_lcdWriteReg(0x004e,0x0000);    DelayTask(1);
#endif
	lld_lcdWriteReg(0x0000,0x0001);		lld_lcdDelay(5);
    lld_lcdWriteReg(0x0003,0xA8A4);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x000C,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x000D,0x080C);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x000E,0x2B00);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x001E,0x00B0);    	lld_lcdDelay(5);
	lld_lcdWriteReg(0x0001,0x2B3F);		lld_lcdDelay(5);
    lld_lcdWriteReg(0x0002,0x0600);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0010,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0011,0x6070);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0005,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0006,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0016,0xEF1C);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0017,0x0003);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0007,0x0133);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x000B,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x000F,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0041,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0042,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0048,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0049,0x013F);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x004A,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x004B,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0044,0xEF00);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0045,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0046,0x013F);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0030,0x0707);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0031,0x0204);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0032,0x0204);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0033,0x0502);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0034,0x0507);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0035,0x0204);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0036,0x0204);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0037,0x0502);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x003A,0x0302);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x003B,0x0302);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0023,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0024,0x0000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x0025,0x8000);    	lld_lcdDelay(5);
    lld_lcdWriteReg(0x004f,0x0000);		lld_lcdDelay(5);
    lld_lcdWriteReg(0x004e,0x0000);		lld_lcdDelay(5);


	#if defined(LCD_USE_FSMC)
		/* FSMC delay reduced as the controller now runs at full speed */
		FSMC_Bank1->BTCR[FSMC_Bank+1] = FSMC_BTR1_ADDSET_0 | FSMC_BTR1_DATAST_2 | FSMC_BTR1_BUSTURN_0 ;
		FSMC_Bank1->BTCR[FSMC_Bank] = FSMC_BCR1_MWID_0 | FSMC_BCR1_WREN | FSMC_BCR1_MBKEN;
	#endif

    /* Initialise the GDISP structure */
	GDISP.Width = SCREEN_WIDTH;
	GDISP.Height = SCREEN_HEIGHT;
	GDISP.Orientation = portrait;
	GDISP.Powermode = powerOn;
	GDISP.Backlight = 100;
	GDISP.Contrast = 50;
	#if GDISP_NEED_VALIDATION || GDISP_NEED_CLIP
		GDISP.clipx0 = 0;
		GDISP.clipy0 = 0;
		GDISP.clipx1 = GDISP.Width;
		GDISP.clipy1 = GDISP.Height;
	#endif
	return TRUE;
}

/**
 * @brief   Draws a pixel on the display.
 *
 * @param[in] x        X location of the pixel
 * @param[in] y        Y location of the pixel
 * @param[in] color    The color of the pixel
 *
 * @notapi
 */
void GDISP_LLD(drawpixel)(coord_t x, coord_t y, color_t color) {
	#if GDISP_NEED_VALIDATION || GDISP_NEED_CLIP
		if (x < GDISP.clipx0 || y < GDISP.clipy0 || x >= GDISP.clipx1 || y >= GDISP.clipy1) return;
	#endif
	lld_lcdSetCursor(x, y);
	lld_lcdWriteReg(0x0022, color);
}

